<template>
  <div class="dataimport">
    <div v-loading="loadingVisible" class="container">
      <div class="data-con">
        <div class="data-line"></div>
        <h3>尊敬的会员，感谢您选择“大黄狗管车”。</h3>

        <!-- <h4>导入前准备</h4> -->
        <p>
          <span class="ps1">您确认，</span> 在您注册成为“大黄狗管车”会员并接受服务之前，您已充分阅读、理解并接受本协议的全部内容；一旦您开始使用“大黄狗管车”服务，即表示您同意遵循本协议所有约定。
        </p>
        <p>
          <span class="ps1">您同意 ，</span> 本公司有权随时对本协议内容进行单方面的变更，并以在本网站公告的方式予以公布，无需另行单独通知；若您在本协议内容公告变更后继续使用本服务的，表示您已充分阅读、理解并接受修改后的协议条款内容，也将遵循修改后的协议内容使用本服务；若您不同意修改后的协议条款内容，您应停止使用本服务。
        </p>
        <p>
          <span class="ps1">您声明 ，</span> 您同意接受本协议并注册成为“大黄狗管车”会员。您是具有法律规定的完全民事行为能力，能够独立承担民事责任的自然人。不具备前述条件的，您应立即终止注册或停止使用本服务。
        </p>
        <!-- <p>4.确保Excel中数据格式正确。比如手机号码格式为11位的大陆手机号，日期格式为2017/01/01，日期数字格式中均不能含有中文。</p>
        <p>5.如果表单中有设置必填项字段，再Excel中对应的列下，都必须有数据/值的。</p>
        <p>6.Excel多余的列无法导入，记得删除Excel不需要导入的列。</p>
        <p>7.不支持Excel公式</p>-->
        <div class="ag">
          <div class="ag-title">第一条 车辆运营管理软件</div>
          <p>1.1、“有车有货科技”：指“有车有货（深圳）科技有限公司”的简称。</p>
          <p>1.2、“有车有货”：指有车有货科技提供大黄狗管车车辆运营管理软件服务平台，主要功能包括汽车租赁服务相关的功能。</p>
          <p>1.3、“会员”：指申请并通过“有车有货”审核后的用户。</p>
          <div class="ag-title">第二条 授权使用期限与服务成本费</div>
          <p>2.1 有车有货使用期限：</p>
          <p>固定期限（叁年）：授权开始时间从会员注册审核通过后开始计算，甲乙双方到期前欲续约的，经协商一致另行签订《有车有货软件使用协议》。</p>
          <p>2.2 费用标准：</p>
          <p>(1) 有车有货科技免费提供有车有货给会员提供车辆基本管理服务，部分增值性服务需要另外充值使用，详见《有车有货产品帮助文档》，有车有货科技在收到会员费用后在三个工作日内为会员开通相应的有车有货增值性服务功能。</p>
          <p>(2) 有车有货科技除了享有本合同中规定的其他权利之外，在会员授权到期的情况下，有车有货科技有权中止或终止本合同，并自动停止会员与本软件的服务连接。当会员要求重新接入服务时，有车有货科技有权要向会员重新续签《软件使用协议》。对于延期签订的客户，有车有货科技没有义务替会员保留数据，如果会员超过 60日没有续签， 这些数据有可能被永久删除，有车有货科技对此不承担任何责任。</p>
          <p>(3) 在会员授权使用期结束时，双方均可终止本合同。如果合同被终止（除由于违反合同致使合同终止之外），并且会员此时提出导出数据要求的话，有车有货科技可应会员要求在合同终止后的 30日之内，向会员提供一个关于客户数据信息的文件或获取文件的方法。在合同终止 60天后，系统将自动删除会员保存在本软件内的数据。</p>
          <p>2.3 约束：</p>
          <p>（1）会员在使用期限内中途退出不使用有车有货科技有车有货软件，会员所有已付或预缴费用有车有货科技不予退还。</p>
          <p>（2）为了更好的服务客户，签订协议后，有车有货科技会配置服务人员，会员应该尽快导入数据使用，协议签订后 15天如无使用痕迹，系统将自动注销账号。</p>

          <div class="ag-title">第三条 有车有货科技提供的服务</div>
          <p>3.1 有车有货科技授权许可会员享有对有车有货非独占的，非排他的，普通的许可使用权。有车有货科技根据授权等级向会员提供特定授权账号，会员可根据授权账号的相应授权使用有车有货的全部或部分功能，同时有车有货科技开放后台管理系统的子账户，会员可通过子账户查询、管理、维护相关数据。</p>
          <p>3.2 在会员使用有车有货期间，有车有货科技负责该系统的正常维护工作，在该系统出现故障的情况下，有车有货科技会尽快保障该系统尽快恢复正常。有车有货有完善的数据安全保障功能，会员也可为保证其数据安全定期作好数据备份工作， 《 有车有货数据安全和保密协议 》参见附件一。</p>
          <p>3.3 在会员使用有车有货期间，会员在有车有货使用、维护或导入数据恢复方面需要协助的，有车有货科技工作人员通过即时通讯工具（如微信、 QQ等）向会员提供指导；需要有车有货科技工作人员提供上门服务的，需有车有货科技将收取适当的工时及差旅费用，相关费用由甲乙双方协商确定。</p>
          <p>3.4 有车有货科技对有车有货进行更新，升级的，会员可免费更新、升级。</p>
          <p>3.5 有车有货科技应负有会员所有经营数据对外保密的责任，如因有车有货科技原因导致会员数据泄露给会员造成经济损失的，有车有货科技愿意承担所有损失。</p>
          <p>3.6 会员使用有车有货作为其与用户之间的管理工具，应当按照有车有货的《软件使用协议》合理约束其与用户之间的行为。有车有货科技不涉及会员与其用户之间的任何法律行为，也不承担会员与其用户之间的任何法律责任。</p>
          <p>3.7 有车有货科技提供有车有货配套的 GPS 设备及安装服务，如果会员需要，可以另外签订采购协议 《 有车有货 GPS设备采购协议 》。</p>

          <div class="ag-title">第四条 会员的权利与义务</div>
          <p>4.1 会员不得将有车有货使用权出租、出借、销售、转让、非存档目的的拷贝或通过提供分许可、转许可、信息网络等形式供任何第三人使用。</p>
          <p>4.2 会员不得以任何方式对有车有货进行全部或部分地翻译、分解、修改、反编译、反汇编、反向工程或其他任何侵犯有车有货科技对有车有货的全部知识产权的行为，对会员前述行为，有车有货科技有权追究其侵权责任。因会员前述行为导致有车有货不能正常运行的，有车有货科技对此不提供任何的服务；由此造成有车有货科技或其他第三方损失的，全部责任由会员承担。</p>
          <p>4.3 在会员使用有车有货期间， 会员要妥善管理有车有货提供的后台管理账户，会员增设其他管理子账户由会员自行管理负责。</p>

          <div class="ag-title">第五条不可抗力</div>
          <p>5.1 “不可抗力”是指所有超出本合同双方合理控制范围的事件，该事件应不可预见，或虽然可以预见，但通过合理努力无法阻止或避免其发生，且这类事件发生于本合同签字之后，并且阻止任何一方全部或部分履行本合同。</p>
          <p>5.2 如果不可抗力事件致使该方未能全部履行其在本合同项下的义务，双方应立即相互协商以找出合理解决办法并应尽所有合理的努力尽可能地减小不可抗力的后果。</p>
          <p>5.3 在不可抗力事件发生后的 5天内，该方应书面通知对方，解释其未履行及不能完全履行其在本合同项下的义务之原因，并且其履行本合同的期限应延长，延长期应与不可抗力事件造成的拖延相同。</p>

          <div class="ag-title">第六条 协议解除与终止</div>
          <p>6.1 当发生以下情形时，有车有货科技有权关闭会员的有车有货使用权或解除本协议，并不予返还会员已支付的费用：</p>
          <p>（1）会员利用有车有货进行非法活动。</p>
          <p>（2）会员逾期付款超过 30日。</p>
          <p>（3）未得到有车有货科技的书面许可，会员将本协议中的内容及在本协议履行过程中获得的有车有货科技的商业秘密向任何第三方泄露、透露和披露的进行处罚。并承担由此造成有车有货科技损失的赔偿责任。</p>
          <p>（4）会员将有车有货科技授权使用的 有车有货 进行出租、出借、销售、转让、非存档目的的拷贝或通过提供分许可、转许可、信息网络等形式供任何第三人使用的进行处罚。并承担由此造成有车有货科技损失的赔偿责任。</p>
          <p>6.2 如有车有货科技产品有侵犯他人知识产权的行为而丧失有车有货的授权资格，会员有权解除本协议，且有车有货科技需按照会员剩余使用权限按比例退还会员已支付费用。</p>
          <p>6.3 协议解除或终止后，会员将不再享有有车有货的使用权，会员在系统里的信息和数据可在协议解除或终止后保留 7日，会员应在此期限完成数据的导出、备份，否则一切后果自行承担。</p>

          <div class="ag-title">第七条 违约责任</div>
          <p>7.1 会员应当按照本协议约定的期限按时，足额付款，如有逾期，会员应向有车有货科技承担逾期金额 0.3%/天的惩罚性违约金，逾期达到 30天有车有货科技有权利关闭会员有车有货系统或终止协议，会员已付费用不予返还。</p>
          <p>7.2 会员如有违法使用有车有货，或恶意泄露有车有货商业机密，恶意篡改，仿冒，抄袭有车有货，私自转卖，转让有车有货使用权的行为，有车有货科技有权单方终止协议，对有车有货科技造成的一切损失均由会员承担赔偿责任。</p>
          <p>7.3 会员在使用有车有货过程中，如因自身运营的产品侵犯了第三方的版权或者用有车有货发布违法信息等所产生的一切刑事、行政、民事等责任均与有车有货科技无关，会员须独自承担由此造成的所有责任。</p>

          <div class="ag-title">第八条附则</div>
          <p>8.1 本协议一式叁份，有车有货科技贰份，会员壹份，经双方盖章后即行生效，涂改及手写条款无效。</p>
          <p>8.2 本协议的所有附件均为本协议不可分割的一部分，如有未尽事宜，经双方协商后可进行增加补充协议或修改原协议的条款。</p>
          <p>8.3 所有由本协议产生的争议，双方应当友好协商解决。协商解决不成的，任何一方均可以向深圳当地法院申请仲裁。</p>
          <p>8.4 本协议全部或部分解除或终止的，均不影响本协议中违约责任、争议解决方式、管辖方式条款的法律效力。</p>

          <div class="ag-title">附件一</div>
          <div class="title-secrecy">有车有货数据安全和保密协议</div>
          <p>一、保密的内容和范围</p>
          <p>（1） 涉及会员具体的信息，包括会员使用有车有货服务保存在有车有货科技器上的数据。</p>
          <p>（2） 凡以直接、间接、口头或书面等形式提供涉及保密内容的行为均属泄密。</p>
          <p>二、会员的权利与义务</p>
          <p>（1）会员有义务管理好进入系统的各类数据权限和账户以及其他信息，因会员原因造成的数据安全和泄露问题将由会员自行负责，有车有货科技不对该事件做任何承诺和保护</p>
          <p>（2）会员有权利通过系统的方式做数据的任何操作，会员因此对操作的结果和造成的影响负担所有责任</p>
          <p>（3）会员明确不将系统、账户、资料出借或用于其他目的的非会员自有人员使用，这些行为包括但不仅限于：</p>
          <p>a) 用于第三方非会员人员或机构使用</p>
          <p>b) 用于有车有货科技的竞争品牌了解或模仿本系统以及服务</p>
          <p>c) 用于对有车有货科技系统和服务的恶意攻击行为</p>
          <p>d) 其他对有车有货科技构成危害的行为</p>
          <p>如发生以上情况，有车有货科技有权利终止服务，并不退回已收取的任何服务费用。</p>
          <p>三、有车有货科技的权利与义务</p>
          <p>（1）有车有货科技应自觉维护会员的利益，严格遵守本委托方的保密规定。</p>
          <p>（2）有车有货科技不得向任何单位和个人泄露所掌握的商业秘密事项；</p>
          <p>（3）有车有货科技了解并承认，通过系统会员会将有具有商业价值的业绩资料（保密信息）保存于有车有货的服务器上，并且由于技术服务等原因，有车有货科技有可能在某些情况下访问这些数据。有车有货科技承认，如果这些数据未经许可披露给他人，有可能使会员蒙受损失</p>
          <p>（4）有车有货科技同意并承诺，对所有保密信息予以严格保密，在未得到会员事先许可的情况下不披露给任何其他人士或机构。</p>
          <p>（5）有车有货科技同意并承诺，无论任何原因，服务终止后，有车有货科技不可恢复地删除服务器上的任何保密信息，并不留存任何副本。同时，有车有货科技保证退回会员保存在有车有货科技器上的任何含有保密信息的文件或资料（如有）。</p>
        </div>
      </div>
    </div>
  </div>
</template>
<script>
import Const from '@/utils/const'
import request from '@/utils/request'
import store from '@/store/index'
export default {
  data() {
    return {}
  },
  mounted() {},
  methods: {}
}
</script>

<style lang="scss" scoped>
.container {
  height: 70vh;
  overflow-y: auto;
}
.data-con {
  .data-line {
    position: relative;
    width: 100%;
    height: 1px;
    border-bottom: 1px solid #51aa38;
    margin: 20px 0;
  }
  h3 {
    font-size: 20px;
  }
  h4 {
    margin: 20px 0;
  }
  p {
    // height: 36px;
    line-height: 36px;
    .ps1 {
      color: #000;
      font-size: 18px;
      font-weight: 600;
    }
  }
  .ag {
    .ag-title {
      color: #000;
      font-size: 14px;
      font-weight: 500;
    }
  }
  .title-secrecy{
    color: #000;
    font-size: 18px;
    font-weight: 600;
    text-align: center;
    padding: 10px 0;
  }
}
.driveButton {
  width: 106px;
  height: 40px;
  text-align: center;
  position: relative;
  display: inline-block;

  /deep/ span {
    display: inline-block;
    width: 106px;
    height: 40px;
    text-align: center;
    margin-left: 10px;
  }
}
</style>

